{
  "projects": [
    {
      "id": 1,
      "name": "Backstage Boutique",
      "shortdescription": "A shop that combines retail with an immersive fan experience. This section is focused on my favorite band, Coldplay, and their 2011 album, Mylo Xyloto.",
      "longdescription": "This physical specialty retail store design is the western artist version of K-pop merchandise and design that offers a curated selection of fan merch and memorabilia for select western music artists, including solo performers and groups. The mission of Backstage Boutique is to bring western music fans closer to their favorite artists and foster community and connection through a diverse and unique selection of official merchandise, rare collectibles, and fan-centric events. \n\nIn theory, the shop would contain artists of multiple genres due to the wide range of music enjoyed by fans. For the purposes of this project, I chose to focus on one genre and one artist from that genre. The genre I chose is rock, particularly its subcultures alternative rock and pop rock. The artist I picked is the British band, Coldplay. They have been my favorite band since my dad introduced me to their music when I was young (on the lime green MP3 player my sister and I shared). The designs I have made are based on Coldplay's discography, aesthetic, and activism, specifically focusing on their 2011 album, Mylo Xyloto. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/BackstageBoutique01.jpg",
      "images": [
        "/ProjectImages/BackstageBoutique01.jpg",
        "/ProjectImages/BackstageBoutique02.jpg",
        "/ProjectImages/BackstageBoutique03.png",
        "/ProjectImages/BackstageBoutique04.jpg",
        "/ProjectImages/BackstageBoutique05.jpg"
      ]
    },
    {
      "id": 2,
      "name": "Messages of Progress",
      "shortdescription": "A typographic book design that conveys themes of empowerment, activism, and transformation through the inclusion of feminist essays and poetry.",
      "longdescription": "How can typography go beyond letters to elevate meaning, narrate a story, and form comprehension? This project uses typography as the medium to craft the story, while employing unconventional layouts and a distinct perspective. The tone of the typography should be infused with intentionality, inspiration, and curiosity. \n\nMy intended audience for the project is predominantly fellow feminists and women, though it is also welcoming of those not from the aforementioned communities who are open to learn and think critically. Part of my goal with this project is for it to provide comfort and a sense of community for women while inspiring and educating everyone. \n\nMessages of Progress is a book typographically designed by a feminist, including work from feminists, for feminists. \n\nThe essays used in this book are How Change Happens by Rebecca Solnit and Sister Outsider by Audre Lorde. The poems used in this book are Still I Rise by Maya Angelou, Diving into the Wreck by Adreinne Rich, and All the Good Women are Gone by Susan Nguyen. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/MessagesOfProgress01.jpg",
      "images": [
        "/ProjectImages/MessagesOfProgress01.jpg",
        "/ProjectImages/MessagesOfProgress02.jpg",
        "/ProjectImages/MessagesOfProgress03.jpg",
        "/ProjectImages/MessagesofProgress04.png",
        "/ProjectImages/MessagesofProgress05.jpg",
        "/ProjectImages/MessagesOfProgress06.jpg",
        "/ProjectImages/MessagesOfProgress07.jpg"
      ]
    },
    {
      "id": 3,
      "name": "Meta/Physical",
      "shortdescription": "Meta/Physical Therapy stars visual and performance artist Shana Moulton. This wild posting design advertises the exhibit that showed at the MoMA.",
      "longdescription": "Meta/Physical Therapy was an exhibition that premiered a new site-specific installation by Shana Moulton, located at the MoMA. Shana Moulton is an American contemporary artist renowned for her multimedia installations and video performances that delve into themes of consumerism, wellness culture, and the journey to self-improvement — all typically characterized by her alter ego, Cynthia, who navigates and interacts with these surreal landscapes. With her distinctive blend of whimsy and critique, Shana Moulton continues to captivate audiences with her thought-provoking explorations of contemporary culture, offering a unique perspective on the complexities of modern life. This particular performance piece is an extension of her early work, Moulton’s Whispering Pines series, which began in 2002. This project is an examination of pain and healing as well as the mass marketing of wellness and maladies of middle age. The installation was also accompanied by a series of performances created in collaboration with composer Nick Hallett. \n\nThe four poster series design serves to advertise the performance event taking place at the MoMa in 2024. They are done in a wild posting style to emphasize the quantity in which they could be produced and the urban settings they would be placed in. The color palette, scanned typography, and arrangement of design elements is directly inspired from Moulton’s surreal and whimsical sets and style. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/Metaphysical01.jpg",
      "images": [
        "/ProjectImages/Metaphysical01.jpg",
        "/ProjectImages/Metaphysical02.jpg",
        "/ProjectImages/Metaphysical03.jpg",
        "/ProjectImages/Metaphysical04.jpg",
        "/ProjectImages/Metaphysical05.jpg",
        "/ProjectImages/Metaphysical06.jpg"
      ]
    },
    {
      "id": 4,
      "name": "Ready, Set, Go",
      "shortdescription": "A poster series and motion type video set to music to advertise a fictional racing event.",
      "longdescription": "This three poster series promotes a fictional racing event set to take place at the iconic Laguna Seca Raceway, reimagined here as a dramatic convergence of speed, rivalry, and visual storytelling. Each part of the classic slogan “Ready, Set, Go!” corresponds to a different car and team pairing. This progression mirrors the start of a race to heighten anticipation and excitement for the event. \n\nThis project is primarily typography-focused. Each design element communicates speed, precision, and grittiness — all common aspects for this type of event. The poster series combines physical elements with digital to create a comprehensive design. The tire track marks were created by me through inking my father’s car tire and driving over a large strip of paper, before scanning it into Photoshop and editing it into the background of each poster. Digital and physical texture combined with futuristic typography represent the concept of being at a race track and watching each car scream by. With the type - in - motion piece, the typography was made simpler for better readability at quick speeds. \n\nReady, Set, Go doesn’t just advertise a race — it declares a challenge, a spectacle, and an experience waiting to unfold. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/ReadySetGo01.png",
      "images": [
        "/ProjectImages/ReadySetGo01.png",
        "/ProjectImages/ReadySetGo02.png",
        "/ProjectImages/ReadySetGo03.png",
        "/ProjectImages/ReadySetGo04.png",
        "/ProjectImages/ReadySetGo05.mp4"
      ]
    },
    {
      "id": 5,
      "name": "Sweet Water Spa",
      "shortdescription": "A branding refresh and website redesign for a local business that evokes the essence of Savannah while maintaining brand personality.",
      "longdescription": "This website redesign creates a serene, immersive digital experience that mirrors the tranquil and rejuvenating atmosphere of the spa itself. By grounding the design in the beauty and heritage of Savannah — particularly its iconic springtime azaleas — the site becomes more than a tool for booking an appointment; it becomes an extension of the spa’s brand philosophy: rooted in local charm, nature’s rhythms, and holistic wellness. The updated colors and logo are inspired by those azaleas that are prominent across the numerous squares and parks. \n\nThis identity shift isn’t just aesthetic; it signals a refreshed commitment to quality, intentional service, and Savannah’s natural beauty. Ultimately, the redesign is meant to elevate the overall customer journey. From first click to final confirmation, the website guides users through the spa’s offerings with clarity, softness, and trust. With immersive imagery, intuitive navigation, and a color story that blooms across the screen, Sweet Water Spa’s digital presence will match the restorative experience clients feel the moment they step through the doors. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/SweetWaterSpa01.jpg",
      "images": [
        "/ProjectImages/SweetWaterSpa01.jpg",
        "/ProjectImages/SweetWaterSpa02.jpg",
        "/ProjectImages/SweetWaterSpa03.jpg",
        "/ProjectImages/SweetWaterSpa04.mp4",
        "/ProjectImages/SweetWaterSpa05.jpg",
        "/ProjectImages/SweetWaterSpa06.jpg",
        "/ProjectImages/SweetWaterSpa07.jpg"
      ]
    },
    {
      "id": 6,
      "name": "The Unsung",
      "shortdescription": "A compelling museum exhibit design that spotlights the overlooked and under- appreciated roles that women played in World War II.",
      "longdescription": "This project’s mission is to illuminate the untold stories of women’s contributions during World War II, showcasing their courage, resilience, and dedication. Through immersive visuals, interactive displays, and compelling narratives, the goal is to foster a deeper understanding of these women’s pivotal roles in the war, encouraging visitors to appreciate the diverse and essential contributions of women in shaping the course of history. \n\nWorld War II was a significant event for the women’s rights movement in the United States because it expanded the opportunities available to women and introduced them to new lines of work, enabling them to prove their equal efforts and abilities. The Unsung is a compelling museum exhibit that spotlights the overlooked and under-appreciated roles women played in World War II. These roles include the resistance (soldiers, spies, and intelligence agents), factory workers, and frontline medical professionals. \n\nThe original coffee table book was printed on Neenah paper and case bound with chipboard. The three 30”x40” posters were spray-mounted to foam board with the portraits being mounted on a separate piece of board before being attached to add depth. While the print production was done on a smaller scale, this exhibit would theoretically be installed in a museum space. \n\nCreated through studio courses at the Savannah College of Art and Design.",
      "tile": "/ProjectImages/Unsung00.png",
      "images": [
        "/ProjectImages/Unsung01.png",
        "/ProjectImages/Unsung02.png",
        "/ProjectImages/Unsung03.png",
        "/ProjectImages/Unsung04.png",
        "/ProjectImages/Unsung05.png",
        "/ProjectImages/Unsung06.jpg",
        "/ProjectImages/Unsung07.jpg",
        "/ProjectImages/Unsung08.jpg"
      ]
    }
  ]
}
